# Data Ingestion: Tabular Data using Pandas

**What is Pandas?**

Pandas is an open source Python package that allow us to load tabular data directly into our Python environment. This notebook will briefly introduce: 1)The fundamental data structures in pandas and basic operations that can be performed, 2) how to load tabular data into a pandas DataFrame and 3) using pandas to load data from Excel files.

The outline for this notebook is as follows:

1. <a href='#1.-Series'>Introduction to Series</a>
2. <a href='#2.-DataFrames'>Introduction to DataFrames</a>
3. <a href='#3.-Loading-Tabular-Data'>Loading Tabular Data (CSV)</a>
4. <a href='#4.-Loading-Excel-files'>Loading Excel Files</a>
5. <a href='#5.-DataFrame-Methods'>DataFrame Methods</a>

**The first step is to import the pandas library**

In [1]:
#import libraries
import pandas as pd #pd is the widely adopted alias for pandas

## 1. Series
A series is one-dimensional (array-like) data structure that contains a sequence of homogenous values. Each value in the sequence has an associated label, called an index.

#### Define a Series with Default Indices
You can create a series using a list or numpy array.

In [2]:
#create a series
grades = [97, 88, 75, 81, 92.0]
result = pd.Series(grades)
result

0    97.0
1    88.0
2    75.0
3    81.0
4    92.0
dtype: float64

#### Define a Series with Custom Indices

In [3]:
grades = [97, 88, 75, 81, 92]
names  = ['Jane', 'John', 'George', 'Judy', 'Elroy']
result = pd.Series(grades, index=names)
result

Jane      97
John      88
George    75
Judy      81
Elroy     92
dtype: int64

In [4]:
#display the values in the series
result.values

array([97, 88, 75, 81, 92])

In [5]:
#display the index in the series
result.index

Index(['Jane', 'John', 'George', 'Judy', 'Elroy'], dtype='object')

#### Accessing the Values in a Series
We can access a value using its index. Here is an example:

In [6]:
result['John']

88

#### Changing the Values in a Series
We can update a value using the index, and the changes are performed in-place. The example below will reduce Elroy's grade by 2 points.

In [7]:
#update the corresponding value using the index
result['Elroy'] -= 2
result

Jane      97
John      88
George    75
Judy      81
Elroy     90
dtype: int64

#### Alternative Way to Create a Series
We can use a dictionary which contains key/value pairs as an alternative way to create a series. Here is an example that creates a dictionary with the names of students and initialized it with their respective grades. The dictionary is then used to create the series.

In [8]:
#Alternative Series definition
student_dict = {'jane': 97, 'john': 89, 'mary': 86}

result = pd.Series(student_dict)
result

jane    97
john    89
mary    86
dtype: int64

#### Other useful Methods
Series provides many useful methods and the complete list can be found [at the following link](https://pandas.pydata.org/docs/reference/api/pandas.Series.html). However the most common methods are

- count()
- min()
- max()
- mean()
- std()
- describe()

`Practice:`I recommend that you use the data from the series to experiment with the functions above. 

The example below demonstrates the `describe()` function, which provides descriptive statistics for the series.

In [9]:
result.describe()

count     3.000000
mean     90.666667
std       5.686241
min      86.000000
25%      87.500000
50%      89.000000
75%      93.000000
max      97.000000
dtype: float64

## 2. DataFrames
A dataframe is a data structure that allows us to store tabular data. The columns in a dataframe is a series, and each column can represent a different data type. The rows are referred to as observations and the columns are called variables. 

#### Create a DataFrame using a Dictionary
You can manually create a dataframe using a dictionary, as follows:

In [10]:
student_dict = {'jane': [97, 88.6, 92.7], 'john': [89, 70, 99.7], 'mary': [86, 92.5, 87]}
grades_df    = pd.DataFrame(student_dict)
grades_df

   jane  john  mary
0  97.0  89.0  86.0
1  88.6  70.0  92.5
2  92.7  99.7  87.0

In the example above, each column represents the data for a given student and each row depicts the performance of all three students on a given exam. The default behavior of a dataframe is to assign a default label for each row, this is the row index. However, these auto-incremented values are not very intuitive, so we can create our own custom indices. We can use the index attribute to change the DataFrame’s default indices to our custom labels as follows:

In [11]:
student_dict = {'jane': [97, 88.6, 92.7], 'john': [89, 70, 99.7], 'mary': [86, 92.5, 87]}
grades_df    = pd.DataFrame(student_dict, index=['exam 1', 'exam 2', 'exam 3'])
grades_df

        jane  john  mary
exam 1  97.0  89.0  86.0
exam 2  88.6  70.0  92.5
exam 3  92.7  99.7  87.0

In [12]:
#This is an alternative way to change the index if you already defined the dataframe, and do not want to recreate it.
grades_df.index = ['exam 1', 'exam 2', 'exam 3']

#### Get the row and column labels
When working with larger dataframes, there are times that you will need to retrieve the index for the rows and columns. This can be obtained using the following:

In [13]:
grades_df.columns #get the column labels

Index(['jane', 'john', 'mary'], dtype='object')

In [14]:
grades_df.index #get the row labels

Index(['exam 1', 'exam 2', 'exam 3'], dtype='object')

#### Accessing each Variable/Column
We can access a specific variable in our dataframe directly using the column's data label. This extracts the entire data from the column and the result thats returned is a series. Here is an example:

In [15]:
grades_df['mary']

exam 1    86.0
exam 2    92.5
exam 3    87.0
Name: mary, dtype: float64

In [16]:
type(grades_df['mary'])

pandas.core.series.Series

## 3. Loading-Tabular-Data
#### Create a DataFrame using a Flat file
The alternative way to create a dataframe is to load a flat file in your python environment. One of the many methods that pandas provides is the `read_csv()` function. This function allows us to read files that are stored locally (on our computer) and also from the web.

In this example, I will demonstrate how to read a csv file that contains data on sharks worldwide. The data was obtained from the **Global Shark Attack File (GSAF)**; here is a [link to their website](https://www.sharkattackfile.net/index.htm). The GSAF is an initiative that records an incident log of verifiable shark encounters worldwide, and its often used by researchers to learn more about human/shark interactions.  

I'll demonstrate how to load a local copy of the CSV file from this resource and also how to load the corresponding excel version.

In [17]:
#load data from a csv file
shark_df = pd.read_csv('gsaf.csv') #the filename is the arguement. If this file was on the web, we would use the URL
type(shark_df)

pandas.core.frame.DataFrame

After loading the data, inspect its properties to verify if the data was imported correctly i.e. does it contain the expected number of rows and columns. We should also verify if each column/variable has a suitable data type (which we will address in the EDA process).

In [18]:
shark_df.info() #show the properties of the data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6700 entries, 0 to 6699
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             6696 non-null   object
 1   Date                    6700 non-null   object
 2   Year                    6698 non-null   float64
 3   Type                    6685 non-null   object
 4   Country                 6650 non-null   object
 5   Area                    6228 non-null   object
 6   Location                6146 non-null   object
 7   Activity                6131 non-null   object
 8   Name                    6485 non-null   object
 9   Sex                     6126 non-null   object
 10  Age                     3769 non-null   object
 11  Injury                  6668 non-null   object
 12  Fatal (Y/N)             6147 non-null   object
 13  Time                    3245 non-null   object
 14  Species                 3684 non-null   object
 15  Investigator or Source  6681 non-null   object
dtypes: float64(1), object(15)
memory usage: 837.6+ KB

The `df.info()` method provides a summary which contains the number of rows and columns in the dataframe e.g. `RangeIndex: 6700 entries` and `Data columns (total 16 columns)` respectively. It also itemized each column and indicates its respective data type. The last two lines provide a summary on the number of columns with respect to the data type and the memory usage of the dataframe.

The output from the informative, is very information and we can see that the data contains a case number, the year and date, the type of attack, and the region in where the attack occurred. We also see the name, gender and age of the person who was involved, the type of activity they were participating in when the attack happened, along with additional information on any injuries or fatalities and the shark Species that was involved.


However, if you only want to retrieve the dimensions for the dataframe, we can use the `.shape` method as follows:

In [19]:
shark_df.shape  #view the number of observations and variables

(6700, 16)

The `.shape` method returns a tuple; the first element represents the number of rows and the second element is the number of columns.

We need to inspect samples of the data to verify if it aligns with our expectations. we can use the `.head()` or `tail()` function to obtain the first or last five rows from the dataframe.  If we would like to see more than 5, we can provide an argument to the function.

The example below demonstrates the head and tail function, using the default value of 5 observations.

In [20]:
shark_df.head() #view the first 5 observations

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source
0,2021.09.10,10-Sep-2021,2021.0,NaN,EGYPT,NaN,Sidi Abdel Rahmen,Swimming,Mohamed,M,NaN,Laceration to arm caused by metal object,NaN,NaN,No shark invovlement,Dr. M. Fouda & M. Salrm
1,2021.09.09,09-Sep-2021,2021.0,Unprovoked,USA,Florida,"Ponce Inlet, Volusia County",Surfing,Doyle Neilsen,M,!6,Minor injury to right arm,N,13h20,NaN,"Daytona Beach News-Journal, 9/14/2021"
2,2021.09.05,05-Sep-2021,2021.0,Unprovoked,AUSTRALIA,New South Wales,Emerald Beach,Surfing,Timothy Thompson,M,31,FATAL,Y,10h30,White xhark,"B. Myatt, GSAF"
3,2021.09.03.b,03-Sep-2021,2021.0,Unprovoked,British Overseas Territory,Turks and Caicos,NaN,NaN,male,M,NaN,Wrist bitten,N,NaN,NaN,Anonymous
4,2021.08.28,28-Aug-2021,2021.0,Unprovoked,USA,Texas,"Galveston Island, Galveston County",Boogie boarding,male,M,!!,Lacerations both sides of lower leg immediatel...,N,11h45,NaN,"T. Craig, GSAF & K. McMurray, TrackingShark.com"

In [21]:
shark_df.tail() #view the last 5 observations

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source
6695,ND.0005,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,FATAL,Y,NaN,NaN,"H. Taunton; N. Bartlett, p. 234"
6696,ND.0004,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,FATAL,Y,NaN,NaN,"H. Taunton; N. Bartlett, pp. 233-234"
6697,ND.0003,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,FATAL,Y,NaN,NaN,"F. Schwartz, p.23; C. Creswell, GSAF"
6698,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN,"The Sun, 10/20/1938"
6699,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN,S.W. Baker

In [22]:
shark_df.tail(2) #view the last 2 observations

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source
6698,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN,"The Sun, 10/20/1938"
6699,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN,S.W. Baker

#### Accessing Variables from the DataFrame
We can select one or more variables and/or observations from the dataframe using the index, slicing and subsetting. The example below demonstrate how to retrieve the country variable from the dataframe.

In [23]:
shark_df['Country'] #select a variable using square bracket notation

0                            EGYPT
1                              USA
2                        AUSTRALIA
3       British Overseas Territory
4                              USA
                   ...
6695                     AUSTRALIA
6696                     AUSTRALIA
6697                           USA
6698                        PANAMA
6699            CEYLON (SRI LANKA)
Name: Country, Length: 6700, dtype: object

In [24]:
type(shark_df['Country']) #the extracted data is a series

pandas.core.series.Series

In [25]:
#Alternative approach
shark_df.Country #select a variable using dot notation

0                            EGYPT
1                              USA
2                        AUSTRALIA
3       British Overseas Territory
4                              USA
                   ...
6695                     AUSTRALIA
6696                     AUSTRALIA
6697                           USA
6698                        PANAMA
6699            CEYLON (SRI LANKA)
Name: Country, Length: 6700, dtype: object

#### selecting multiple columns
The example above returns a series that represents each column. However, if we wanted to convert it to a dataframe we can do the following:

In [26]:
shark_df[['Country']]

                         Country
0                          EGYPT
1                            USA
2                      AUSTRALIA
3     British Overseas Territory
4                            USA
...                          ...
6695                   AUSTRALIA
6696                   AUSTRALIA
6697                         USA
6698                      PANAMA
6699          CEYLON (SRI LANKA)

[6700 rows x 1 columns]

If you check the type of the output above, you will see that its in fact a dataframe. If we wanted to extract multiple columns, we could create a list of names. The example below demonstrates how to extract the **Country**, **Area**, and **Location**:

In [27]:
shark_df[['Country', 'Area', 'Location']]

,Country,Area,Location
0,EGYPT,NaN,Sidi Abdel Rahmen
1,USA,Florida,"Ponce Inlet, Volusia County"
2,AUSTRALIA,New South Wales,Emerald Beach
3,British Overseas Territory,Turks and Caicos,NaN
4,USA,Texas,"Galveston Island, Galveston County"
...,...,...,...
6695,AUSTRALIA,Western Australia,Roebuck Bay
6696,AUSTRALIA,Western Australia,NaN
6697,USA,North Carolina,Ocracoke Inlet
6698,PANAMA,NaN,"Panama Bay 8ºN, 79ºW"
6699,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee"

We can also obtain rows from the dataframe, if we specify a slice. The example below, extracts the second and third rows from the dataframe.

In [28]:
shark_df[1:3]

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source
1,2021.09.09,09-Sep-2021,2021.0,Unprovoked,USA,Florida,"Ponce Inlet, Volusia County",Surfing,Doyle Neilsen,M,!6,Minor injury to right arm,N,13h20,NaN,"Daytona Beach News-Journal, 9/14/2021"
2,2021.09.05,05-Sep-2021,2021.0,Unprovoked,AUSTRALIA,New South Wales,Emerald Beach,Surfing,Timothy Thompson,M,31,FATAL,Y,10h30,White xhark,"B. Myatt, GSAF"

#### Advanced Access using `loc` and `iloc`
Seeing that Pandas is built on numpy, we can access the data in a similar manner as you would a 2D numpy array. The `loc` function allow us to access the data based on the respective labels and `iloc` uses the positional index.

**lets extract the second observation, using the loc method**

In [29]:
shark_df.loc[1] #the row index is numeric because we did not change the default behavior when we imported the data

Case Number                                          2021.09.09
Date                                                09-Sep-2021
Year                                                       2021
Type                                                 Unprovoked
Country                                                     USA
Area                                                    Florida
Location                            Ponce Inlet, Volusia County
Activity                                                Surfing
Name                                              Doyle Neilsen
Sex                                                           M
Age                                                          !6
Injury                                Minor injury to right arm
Fatal (Y/N)                                                   N
Time                                                      13h20
Species                                                     NaN
Investigator or Source    Daytona Beach News-Journal, 9/14/2021
Name: 1, dtype: object

As you can see this returned a series, however if we wanted a dataframe we could type the following `shark_df.loc[[1]]`. I'll leave this as an exercise for you to try.

We can select multiple rows, by providing a sequence of indices.

In [30]:
shark_df.loc[[1, 2, 13, 44, 25]] #select multiple rows using a sequence of numbers

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source
1,2021.09.09,09-Sep-2021,2021.0,Unprovoked,USA,Florida,"Ponce Inlet, Volusia County",Surfing,Doyle Neilsen,M,!6,Minor injury to right arm,N,13h20,NaN,"Daytona Beach News-Journal, 9/14/2021"
2,2021.09.05,05-Sep-2021,2021.0,Unprovoked,AUSTRALIA,New South Wales,Emerald Beach,Surfing,Timothy Thompson,M,31,FATAL,Y,10h30,White xhark,"B. Myatt, GSAF"
13,2021.07.30,30-Jul-2021,2021.0,Provoked,USA,Florida,"Ponce Inlet, Volusia County",Fishing,male,M,47,Hands bitten while attempting to unhook shark ...,N,11h00,NaN,"J. Marchand, GSAF"
44,2021.06.11,11-Jun-2021,2021.0,Unprovoked,AUSTRALIA,Western Australia,Five Fingers Reef,Snorkeling,Jackson Bartlett,M,10,Foot bitten,N,11h00,"Bronze whaler shark, 2 m","B. Myatt, GSAF"
25,2021.07.11.R,Reported 11-Jul-2021,2021.0,Provoked,BAHAMAS,NaN,NaN,Jackass Team's publicity stunt for Discovery C...,Sean McInerney,M,NaN,Lacerations to right hand PROVOKED INCIDENT,N,NaN,NaN,"Yahoo.com, 7/11/2021"

The result above returned the required rows and all columns. However, if we wanted to narrow the result we would need to specify the required columns. For example:

In [31]:
#return specific rows and columns
shark_df.loc[[1, 2, 13, 44, 25], ['Country', 'Name', 'Age', 'Injury']]

,Country,Name,Age,Injury
1,USA,Doyle Neilsen,!6,Minor injury to right arm
2,AUSTRALIA,Timothy Thompson,31,FATAL
13,USA,male,47,Hands bitten while attempting to unhook shark ...
44,AUSTRALIA,Jackson Bartlett,10,Foot bitten
25,BAHAMAS,Sean McInerney,NaN,Lacerations to right hand PROVOKED INCIDENT

Now we can clearly see the name of the person who was involved in the shark attack, their age, the type of injury and the country where the attack occurred.

In [32]:
#return all rows and specific columns
shark_df.loc[:, ['Country', 'Name', 'Age', 'Injury']] #select multiple rows using a sequence of numbers

,Country,Name,Age,Injury
0,EGYPT,Mohamed,NaN,Laceration to arm caused by metal object
1,USA,Doyle Neilsen,!6,Minor injury to right arm
2,AUSTRALIA,Timothy Thompson,31,FATAL
3,British Overseas Territory,male,NaN,Wrist bitten
4,USA,male,!!,Lacerations both sides of lower leg immediatel...
...,...,...,...,...
6695,AUSTRALIA,male,NaN,FATAL
6696,AUSTRALIA,Ahmun,NaN,FATAL
6697,USA,Coast Guard personnel,NaN,FATAL
6698,PANAMA,Jules Patterson,NaN,FATAL
6699,CEYLON (SRI LANKA),male,15,"FATAL. ""Shark bit him in half, carrying away t..."

This is the same approach that we took when subsetting numpy arrays, so the logic also holds for pandas dataframes. 

`PRACTICE:` I would encourage you to experiment with this data and perform subsetting.

**lets extract the second observation, using the iloc method**
We can perform all the steps above using the `iloc` method.  Instead of providing the data labels, you will provide the positional index. I'll demonstrate an example below, and leave the rest for you as a practice exercise.

In [33]:
shark_df.iloc[10:25, 5:10] #select multiple rows using a start and end index (i.e. a slice)

,Area,Location,Activity,Name,Sex
10,Florida,"Key Largo, Monroe County",Snorkeling,Lucas Cruz,M
11,South Carolina,"Hilton Head Island, Beaufort County",NaN,a lifguard,M
12,Maryland,"Ocean City, Worcester County",Swimming,Jordan Prushinski,F
13,Florida,"Ponce Inlet, Volusia County",Fishing,male,M
14,North Carolina,Wrightsville Beach,Standing,Arik Nekrazov,M
15,Georgia,"Tybee Island, Chatham County",Surfing,Yamada Atsushi,M
16,Western Australia,Varanus Island,Fishing,male,M
17,New York,"Jones Beach, Nassau County",Swimming,male,M
18,Pernambuco,Piedade,Squatting in the water,Everton dos Reis Guimarães,M
19,Chanthaburi Province,Kung Krabaenbay Royal Département Study Center,Moving captive shark,Boonterm Singhasura,M
20,California,"Capitola Beach, Santa Cruz County",Surfing,Jennifer Romney,F
21,Florida,"Near Patrick AFB, Brevard County",NaN,Katie Wood,F
22,Western Australia,Rottnest Island,Surfing,male,M
23,Florida,"New Smyrna Beach, Volusia County",Boogie boarding,male,M
24,Eastern Cape Province,Jeffrey's Bay,Surfing,Jason Lemmer,M

NOTE: If at any point you need to convert the data into a numpy array, you can use the `.values` method to convert the results to numpy array (if necessary).

## 4. Loading Excel files
The example below demonstrate how to read excel files using `read_excel()`. If the excel file had multiple sheets we could indicate which sheet to read. You can learn more about `read_excel()` from the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html)

In [34]:
shark_df_2 = pd.read_excel('GSAF5.xls')
shark_df_2.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2021.09.10,10-Sep-2021,2021.0,NaN,EGYPT,NaN,Sidi Abdel Rahmen,Swimming,Mohamed,M,...,No shark invovlement,Dr. M. Fouda & M. Salrm,2021.09.10-Mohamed.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2021.09.10,2021.09.10,6700.0,NaN,NaN
1,2021.09.09,09-Sep-2021,2021.0,Unprovoked,USA,Florida,"Ponce Inlet, Volusia County",Surfing,Doyle Neilsen,M,...,NaN,"Daytona Beach News-Journal, 9/14/2021",2021.09.09-Neilsen.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2021.09.09,2021.09.09,6699.0,NaN,NaN
2,2021.09.05,05-Sep-2021,2021.0,Unprovoked,AUSTRALIA,New South Wales,Emerald Beach,Surfing,Timothy Thompson,M,...,White xhark,"B. Myatt, GSAF",2021.09.05-Thompson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2021.09.05,2021.09.05,6698.0,NaN,NaN
3,2021.09.03.b,03-Sep-2021,2021.0,Unprovoked,British Overseas Territory,Turks and Caicos,NaN,NaN,male,M,...,NaN,Anonymous,2021.09.03.b-TurksCaicos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2021.09.03.b,2021.09.03.b,6697.0,NaN,NaN
4,2021.08.28,28-Aug-2021,2021.0,Unprovoked,USA,Texas,"Galveston Island, Galveston County",Boogie boarding,male,M,...,NaN,"T. Craig, GSAF & K. McMurray, TrackingShark.com",2021.08.28.-Galveston.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2021.08.28,2021.08.28,6696.0,NaN,NaN

## 5. DataFrame Methods
Pandas provides basic numerical functions that can be used to calculate descriptive statistics on each variable. Similar to series, we can obtain the `min()`, `max()`, `mean()`, `sum()`, `describe()` etc. For more information on these useful function, view the documentation [at the following link](https://pandas.pydata.org/pandas-docs/version/0.20.2/api.html#api-dataframe-stats).